# -*- coding: utf-8 -*-

"""
----
文件名称: setup.py
----
\\
----
模块概述: 
----
\\
----
作   者: ljl (996153075@qq.com)
----
\\
----
创建日期: 2025/4/3
----
\\
----
版    本: 1.0.0
----
\\
----
依    赖:
----
    - sys
\\
\\
----
使用示例：
----
    - setup.main()
\\
\\
----    
异常处理：
----
    - 
\\
\\
----
注意事项：
----
    -
\\
"""

# ================================================== 特殊属性与导入 ==================================================
# __name__
# __doc__
__all__ = [
    # 变量

    # 函数

    # 类

    # 主函数
    'main',
]
__author__ = '陆家立'
__email__ = '996153075@qq.com'
__version__ = '1.0.0'

import sys


# ================================================== 特殊属性与导入 ==================================================


# ================================================== 全局变量 ==================================================
from setuptools import setup, find_packages

setup(
    name='evolution',
    version='1.0.0',
    packages=find_packages(),
    dependency_links=[
        'https://download.pytorch.org/whl/cu126',
    ],
    install_requires=[
        'torch',
        'torchvision',
        'torchaudio',
        'torch-geometric~=2.6.1',
        'cloud-tpu-client',
        'datasets~=3.4.1',
        'transformers~=4.48.1',
        'evaluate~=0.4.3',
        'biopython~=1.85',
        'pandas~=2.2.3',
        'numpy~=1.26.4',
        'scikit-learn~=1.6.1',
        'xgboost~=3.0.0',
        'scipy~=1.15.2',
        'einops~=0.8.1',
        'biotite~=0.41.2',
        'requests~=2.32.3',
        'huggingface_hub~=0.29.3',
        'openpyxl',
        'sentencepiece',
        'tqdm~=4.67.1',
    ],
    author='陆家立',
    author_email='996153075@qq.com',
    description='基于ESM2特征和深度学习模型的IC50值回归预测',
    long_description=open('README.md').read(),
    long_description_content_type='text/markdown',
    url='https://github.com/lujiali-GX/Evolution',
    classifiers=[
        'Programming Language :: Python :: 3',
        'License :: OSI Approved :: MIT License',
        'Operating System :: OS Independent',
    ],
    python_requires='>=3.12',
)


# ================================================== 全局变量 ==================================================


# ================================================== 函数定义 ==================================================

# ================================================== 函数定义 ==================================================


# ================================================== 类定义 ==================================================

# ================================================== 类定义 ==================================================


# ================================================== 主函数 ==================================================
def main():
    # 解析命令行参数
    if len(sys.argv) > 1:
        arg = sys.argv[1]
        print("收到的参数: {}".format(arg))
    else:
        print("未提供参数.")


# ================================================== 主函数 ==================================================


# ================================================== 程序入口 ==================================================
if __name__ == "__main__":
    main()
# ================================================== 程序入口 ==================================================
